# FamilyThermalProperties Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyThermalProperties Members
FamilyThermalProperties Class Constructors Methods Properties See Also
---
The FamilyThermalProperties type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FamilyThermalProperties | Constructs a new FamilyThermalProperties with default settings. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FamilyThermalProperties |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| Find | Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsValid | Confirms that the thermal properties are correctly set for assignment to a FamilySymbol. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnalyticConstructionName | The construction gbXML name. This value corresponds to the 'Name' property of a constructionType node in Constructions.xml. |
| AnalyticConstructionTypeId | The construction gbXML type. This value corresponds to the 'id' property of a constructionType node in Constructions.xml. |
| HeatTransferCoefficient | The heat transfer coefficient value (U-Value). The units are watts per meter-squared kelvin (W/(m^2*K)). |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| SolarHeatGainCoefficient | The solar heat gain coefficient. |
| ThermalResistance | The calculated thermal resistance value (R-Value). The units are meter-squared kelvin per watt ((m^2*K)/Watt). |
| VisualLightTransmittance | The visual light transmittance. |

# See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace